In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# 한글 적용을 위한 정리
import matplotlib
matplotlib.rcParams['font.family'] = 'Malgun Gothic'
matplotlib.rcParams['axes.unicode_minus'] = False

In [24]:
data = {'eng':[10,30,50,70],
       'kor':[20,40,60,80],
  
        'math':[90,50,20,70]}
df = pd.DataFrame(data,index=['a','b','c','d'])
df

   eng  kor  math
a   10   20    90
b   30   40    50
c   50   60    20
d   70   80    70

In [3]:
df+2

   eng  kor  math
a   12   22    92
b   32   42    52
c   52   62    22
d   72   82    72

In [11]:
df

   eng  kor  math
a   12   20    90
b   32   40    50
c   52   60    20
d   72   80    70

In [19]:
df.loc['b']

eng     32
kor     40
math    50
Name: b, dtype: int64

In [28]:
# 행단위 boolean indexing
df[[True,False,True,True]]

   eng  kor  math
a   10   20    90
c   50   60    20
d   70   80    70

In [26]:
df['eng']>30

a    False
b    False
c     True
d     True
Name: eng, dtype: bool

In [29]:
df[df['eng']>30] # df[[False, False, True, True]]

   eng  kor  math
c   50   60    20
d   70   80    70

In [30]:
(df['kor']== 40 ) | (df['kor'] == 80)

a    False
b     True
c    False
d     True
Name: kor, dtype: bool

In [33]:
df[(df['kor']== 40 ) | (df['kor'] == 80)]

   eng  kor  math
b   30   40    50
d   70   80    70

query 문의 경우에 문자열이 들어간다.<br>
때문에 만약 변수를 넣고 싶다면 f string을 쓰면 된다.

In [35]:
df.query('eng>30') # df[df['eng'] > 30]

   eng  kor  math
c   50   60    20
d   70   80    70

In [36]:
df.query('kor==40 or kor==80') # df[(df['kor']== 40 ) | (df['kor'] == 80)]

   eng  kor  math
b   30   40    50
d   70   80    70

In [37]:
df.query('20<=kor<=50')

   eng  kor  math
a   10   20    90
b   30   40    50